## 5의 norm_wight_cate의 총계를 검사합니다.

### 이슈 : norn_weight_cate의 총합을 구하니 1이 아닌 값이 나오는 이상치가 존재한다.  
하지만 weight_cate를 unique한 uid개수로 나누면서 소수점이 생기고,이 소수점이 무제한 기록이 안되고, 거기에서 총합을 구하니 1의 값이 아닌 이상치가 존재하게 되는거다. 하지만 1에 아주 근접한 값이고, 소수점상의 오류이므로 이번은 넘어간다. 총계를 1로 만들고 싶으면..........(생략..)

In [1]:
# import modules
import pymysql
from sqlalchemy import create_engine
import pandas as pd
from pandas.io import sql
import datetime
import pandas as pd
import pandasql as ps

In [2]:
# reading 
now = datetime.datetime.now() 
print('시작:', now)
five_all = pd.read_csv('./final/five/cluster_cate_weight_publevel/five_allyear.txt', sep='\t')
five_by_year = pd.read_csv('./final/five/cluster_cate_weight_publevel/five_by_year.txt', sep='\t')
now = datetime.datetime.now()
print('종료:', now)

시작: 2024-03-08 09:32:26.420294
종료: 2024-03-08 09:32:33.025107

In [9]:
check1= five_all.groupby(['cluster_id'])['norm_weight_cate'].sum().reset_index(name='sum_weight')

In [10]:
check1

      cluster_id  sum_weight
0              1         1.0
1              2         1.0
2              3         1.0
3              4         1.0
4              5         1.0
...          ...         ...
4210        4211         1.0
4211        4212         1.0
4212        4213         1.0
4213        4214         1.0
4214        4215         1.0

[4215 rows x 2 columns]

In [11]:
check2 = five_by_year.groupby(['cluster_id', 'pubyear'])['norm_weight_cate'].sum().reset_index(name='sum_weight')

In [12]:
check2

       cluster_id  pubyear  sum_weight
0               1     2006         1.0
1               1     2007         1.0
2               1     2008         1.0
3               1     2009         1.0
4               1     2010         1.0
...           ...      ...         ...
67377        4215     2017         1.0
67378        4215     2018         1.0
67379        4215     2019         1.0
67380        4215     2020         1.0
67381        4215     2021         1.0

[67382 rows x 3 columns]

In [15]:
check1.to_excel('./check/five_all.xlsx', index=False)
check2.to_excel('./check/five_by_year.xlsx', index=False)

In [13]:
# 컬럼에 포함된 고유한 값들과 그 빈도수를 확인
unique_values_counts_sum_weight1 = check1['sum_weight'].value_counts()
print(unique_values_counts_sum_weight1)

sum_weight
1.000000    127
1.000000    125
1.000000    122
1.000000    116
1.000000    111
           ...
1.000100      1
1.000104      1
1.000124      1
1.000412      1
1.005882      1
Name: count, Length: 249, dtype: int64

In [14]:
#컬럼에 포함된 고유한 값들과 그 빈도수를 확인
unique_values_counts_sum_weight2 = check2['sum_weight'].value_counts()
print(unique_values_counts_sum_weight2)

sum_weight
1.000000    2860
1.000000    2761
1.000000    2615
1.000000    2582
1.000000    2490
            ...
1.001592       1
1.001148       1
1.001304       1
1.001125       1
1.111111       1
Name: count, Length: 266, dtype: int64

In [ ]:
five_all
five_all_wide
five_by_year
five_byyear_wide